Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT500/periph/PERI_PMC.h
/*! @name PADVRANGE - PMC GPIO VDDIO Range Selection Control */
/*! @{ */

#define PMC_PADVRANGE_VDDIO_0RANGE_MASK          (0x3U)
#define PMC_PADVRANGE_VDDIO_0RANGE_SHIFT         (0U)
/*! VDDIO_0RANGE - VDDIO_0RANGE
 *  0b00..1.71 - 1.98V. Consumes static current to detect VDDIO_0 level. To reduce power consumption, change this value to 01.
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..Not allowed
 *  0b11..Not allowed (hardware translates to 10)
 */
#define PMC_PADVRANGE_VDDIO_0RANGE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDIO_0RANGE_SHIFT)) & PMC_PADVRANGE_VDDIO_0RANGE_MASK)

#define PMC_PADVRANGE_VDDIO_1RANGE_MASK          (0xCU)
#define PMC_PADVRANGE_VDDIO_1RANGE_SHIFT         (2U)
/*! VDDIO_1RANGE - VDDIO1RANGE It is recommended that the user change this value to 01 to reduce power consumption.
 *  0b00..1.71 - 1.98V. Continuous mode. Consumes static current to detect VDDIO_1 level.
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..Not allowed
 *  0b11..Not allowed (hardware translates to 00 = continuous mode)
 */
#define PMC_PADVRANGE_VDDIO_1RANGE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDIO_1RANGE_SHIFT)) & PMC_PADVRANGE_VDDIO_1RANGE_MASK)

#define PMC_PADVRANGE_VDDIO_2RANGE_MASK          (0x30U)
#define PMC_PADVRANGE_VDDIO_2RANGE_SHIFT         (4U)
/*! VDDIO_2RANGE - VDDIO2RANGE
 *  0b00..1.71 - 1.98V. Continuous mode. Consumes static current to detect VDDIO_2 level. To reduce power consumption, change this value to 01.
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..Not allowed
 *  0b11..Not allowed (hardware translates to 00 = continuous mode)
 */
#define PMC_PADVRANGE_VDDIO_2RANGE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDIO_2RANGE_SHIFT)) & PMC_PADVRANGE_VDDIO_2RANGE_MASK)

#define PMC_PADVRANGE_VDDIO_3RANGE_MASK          (0xC0U)
#define PMC_PADVRANGE_VDDIO_3RANGE_SHIFT         (6U)
/*! VDDIO_3RANGE - VDDIO3RANGE
 *  0b00..1.71 - 3.6V. Continuous mode. Consumes static current to detect VDDIO_3 level
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..3.00 - 3.6V, vdde detector off
 *  0b11..Not allowed (hardware translates to 00 = continuous mode)
 */
#define PMC_PADVRANGE_VDDIO_3RANGE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDIO_3RANGE_SHIFT)) & PMC_PADVRANGE_VDDIO_3RANGE_MASK)

#define PMC_PADVRANGE_VDDIO_4RANGE_MASK          (0x300U)
#define PMC_PADVRANGE_VDDIO_4RANGE_SHIFT         (8U)
/*! VDDIO_4RANGE - VDDIO4RANGE
 *  0b00..1.71 - 1.98V. Continuous mode. Consumes static current to detect VDDIO_4 level. To reduce power consumption, change this value to 01.
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..Not allowed
 *  0b11..Not allowed (hardware translates to 00 = continuous mode)
 */
#define PMC_PADVRANGE_VDDIO_4RANGE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDIO_4RANGE_SHIFT)) & PMC_PADVRANGE_VDDIO_4RANGE_MASK)
/*! @} */

/*! @name MEMSEQCTRL - PMC Memory sequencer Control */
/*! @{ */

#define PMC_MEMSEQCTRL_MEMSEQNUM_MASK            (0x3FU)
#define PMC_MEMSEQCTRL_MEMSEQNUM_SHIFT           (0U)
/*! MEMSEQNUM
 *  0b000000..For main system SRAM partitions, 1st array power then periphery power (400ns worst case delay)
 *  0b000001..Turn on 1st memory partition at a time, periphery and array power.switches at the same time.
 *  0b000101..Turn on 5th memory partitions in parallel, periphery and array.
 *  0b111111..All memories are switched on/off at the same time
 */
#define PMC_MEMSEQCTRL_MEMSEQNUM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_MEMSEQCTRL_MEMSEQNUM_SHIFT)) & PMC_MEMSEQCTRL_MEMSEQNUM_MASK)
/*! @} */

/*! @name TSENSOR - PMC Temperature Sensor Control */
/*! @{ */

#define PMC_TSENSOR_TSENSM_MASK                  (0xFU)
#define PMC_TSENSOR_TSENSM_SHIFT                 (0U)
/*! TSENSM - Temperature sensor mode select */
#define PMC_TSENSOR_TSENSM(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_TSENSOR_TSENSM_SHIFT)) & PMC_TSENSOR_TSENSM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PMC_Register_Masks */


/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_PMC_H_ */

